{
  "experiment_name": "Random Forest with Feature Engineering",
  "task_type": "multi-class classification",
  "target_column": "Species",
  "experiment_evaluation_metric": "Macro-averaged AUC",
  "experiment_preprocessing_steps": "Apply StandardScaler preprocessing to all features including engineered features. Load train and test datasets from '/data/train_set.csv' and '/data/test_set.csv'. Extract feature columns ['SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm'] and target column 'Species'. Apply standard scaling after feature engineering to ensure all features are on the same scale.",
  "experiment_feature_engineering_steps": "Create 6 additional engineered features from the original 4 morphological measurements: (1) SepalRatio = SepalLengthCm / SepalWidthCm, (2) PetalRatio = PetalLengthCm / PetalWidthCm, (3) SepalArea = SepalLengthCm * SepalWidthCm (approximate area), (4) PetalArea = PetalLengthCm * PetalWidthCm (approximate area), (5) TotalLength = SepalLengthCm + PetalLengthCm, (6) TotalWidth = SepalWidthCm + PetalWidthCm. These engineered features capture morphological relationships and proportions that are biologically meaningful for iris species classification. Based on exploration experiments, PetalArea and PetalWidthCm showed highest feature importance.",
  "experiment_model_selection_steps": "Use RandomForestClassifier with optimized hyperparameters: n_estimators=100 (balance between performance and computational efficiency), max_depth=10 (deeper than exploration optimal to handle additional engineered features), min_samples_split=2, min_samples_leaf=1, random_state=42 for reproducibility. Apply 5-fold stratified cross-validation to ensure robust performance estimation across all three iris species. The Random Forest algorithm is chosen for its ability to handle feature interactions naturally, provide interpretability through feature importance, and demonstrated strong performance with engineered features in exploration experiments.",
  "experiment_evaluation_strategy": "Primary metric: Macro-averaged AUC (target ≥0.95). Secondary metrics: Accuracy, Precision (macro), Recall (macro), F1-Score (macro). Generate comprehensive evaluation outputs: (1) Confusion matrix with classification errors analysis, (2) ROC curves for each species class, (3) Feature importance plot highlighting top contributing features including engineered ones, (4) Cross-validation performance distribution, (5) Prediction confidence analysis showing model certainty levels, (6) Class-wise performance breakdown comparing individual species classification accuracy, (7) Feature correlation heatmap to understand relationships between original and engineered features. Conduct error analysis on misclassified samples to identify patterns and potential model limitations. Compare performance against LDA baseline to assess improvement areas.",
  "expected_outputs": "Model artifacts: trained RandomForestClassifier model, StandardScaler transformer. Performance reports: comprehensive classification report with all metrics, cross-validation results summary. Visualizations: confusion_matrix.html (interactive confusion matrix), feature_importance.html (engineered + original features ranked by importance), roc_curves.html (individual class ROC curves), prediction_confidence.html (confidence distribution analysis), class_performance.html (per-class detailed metrics), feature_correlation.html (correlation matrix of all features). Analysis reports: detailed model interpretation explaining which engineered features contribute most to species discrimination, error analysis of misclassified samples, comparison with LDA baseline performance highlighting differences in prediction patterns.",
  "iteration_focus": "This iteration introduces meaningful feature engineering to capture morphological relationships (ratios, areas, totals) while maintaining model interpretability. The approach builds upon the perfect LDA baseline by testing whether engineered features can provide additional discriminative power and robustness. Focus is on understanding feature importance patterns and biological interpretability of the model decisions.",
  "data_handling": "Dataset is already split into train (120 samples, 40 per class) and test (30 samples, 10 per class) sets. Use stratified sampling in cross-validation to maintain class balance. Handle all features as continuous numerical variables. No missing values or data quality issues identified in exploration.",
  "success_criteria": "Achieve macro-averaged AUC ≥ 0.95 with high confidence predictions. Feature importance analysis should reveal meaningful biological insights about iris species discrimination. Cross-validation stability with low variance across folds. Clear interpretability of model decisions through feature importance rankings."
}